import {assetsPng} from "./assetsPng";
import {UserBlog, UserData} from "../types";

export const carMarksPopular = ['Acura', 'Audi', 'BMW', 'Cadillac', 'Chery', 'Chevrolet', 'Citroen', 'Dodge', 'FIAT', 'Ford', 'Geely',
    'Haval', 'Honda', 'Hummer', 'Hyundai', 'Infiniti', 'Jaguar', 'Jeep', 'KIA', 'Lada', 'Lancia', 'Land Rover', 'Lexus', 'Mazda', 'Mercedes-Benz',
    'MINI', 'Mitsubishi', 'Nissan', 'Opel', 'Peugeot', 'Porsche', 'Renault', 'Saab', 'SEAT', 'Skoda', 'Smart', 'Subaru', 'Suzuki',
    'Tesla', 'Toyota', 'Volkswagen', 'Volvo', 'ГАЗ', 'ЗАЗ', 'ЛуАЗ', 'УАЗ', 'Другие', 'Самоделки']

export const carMarks = ['AC Cobra', 'Acura', 'Alfa Romeo', 'Alpina', 'AMC', 'ARO', 'Asia', 'Aston Martin',
    'Audi', 'Austin', 'Autozam', 'Avia', 'BAC', 'Barkas', 'BCC', 'Bentley', 'Bertone', 'BMW', 'BOGDAN', 'Brilliance', 'Bugatti', 'Buick',
    'BYD', 'Cadillac', 'Caterham', 'Changan', 'Chery', 'Chevrolet', 'Chrysler',
    'Citroen', 'Cord', 'Cupra', 'Dacia', 'Dadi', 'Daewoo', 'Daihatsu', 'Daimler', 'Datsun', 'de Tomaso', 'DeLorean', 'Derways', 'Dodge', 'Dongfeng', 'DS', 'Eagle', 'Efini', 'Eunos', 'EXEED',
    'FAW', 'Ferrari', 'Fiat', 'Ford', 'Foton', 'FSO', 'GAC', 'Geely', 'Genesis', 'GMC', 'Great Wall', 'Hafei', 'Haima', 'Haval',
    'Hawtai', 'Holden', 'Honda', 'Huangai', 'Hummer', 'Hyundai', 'Infiniti', 'Iran Khodro', 'Isuzu', 'Iveco', 'JAC',
    'Jaguar', 'Jeep', 'Kia', 'KTM', 'Lada', 'Lamborgini', 'Lancia', 'Land Rover', 'LDV', 'Lexus', 'Lifan', 'Ligier', 'Lincoln',
    'Lotus', 'Luxgen', 'Marussia', 'Maserati', 'Maybach', 'Mazda', 'Mercedes-Benz', 'Mercury', 'Mercur', 'MG', 'MINI', 'Mitsubushi',
    'Morgan', 'Morris', 'Nio', 'Nissan', 'Noble', 'Nysa', 'Oldsmobile', 'Opel', 'Peugeot', 'Plymouth', 'Polestar',
    'Pontiac', 'Porsche', 'Proton', 'Ravon', 'Renault', 'Rivian', 'Rolls-Royce', 'Rover', 'Saab', 'Samsung', 'Saturn', 'Scion', 'Seat',
    'Simca', 'Skoda', 'SMA', 'Smart', 'SsangYong', 'Subaru', 'Suzuki', 'Talbot', 'Tata', 'Tatra', 'Tesla', 'Toyota', 'Trabant', 'Vauxhall',
    'Volkswagen', 'Volvo', 'Wartburg', 'Wiesmann', 'Willys', 'Xpeng', 'Zotye', 'ZX', 'Автокам', 'ВИС', 'ГАЗ', 'ЕрАЗ', 'ЗАЗ', 'ЗИЛ',
    'ИЖ', 'Камаз', 'ЛуАЗ', 'Москвич', 'РАФ', 'СеАЗ', 'ТагАЗ', 'УАЗ', 'Другие', 'Самоделки']
export const imgCarArr = [assetsPng.volkswagen, assetsPng.mercedes, assetsPng.mitsubishi, assetsPng.renault, assetsPng.toyota, assetsPng.lada, assetsPng.ford, assetsPng.hyundai]

export const footerLinks: string[] = ['Помощь', 'Написать в Поддержку', 'Символика', 'Facebook',
    'Telegram', 'Mobile DRIVE2', 'О проекте', 'Вакансия', 'Бизнес-аккаунт', 'Реклама и сотрудничество',
    'Правила сайта', 'Пользовательское соглашение', 'Политика обработки персональных данных', '© DRIVE2.UA, 2022'
]

export const allcountry = ['Абхазия', 'Австралия', 'Австрия', 'Азербайджан', 'Азорские острова', 'Аландские острова', 'Албания', 'Алжир', 'Американское Самоа', 'Ангилья', 'Ангола',
    'Андорра', 'Антарктика', 'Антигуа и Барбуда', 'Антильские Острова', 'Аомынь', 'Аргентина', 'Армения', 'Аруба', 'Афганистан', 'Багамские Острова', 'Бангладеш', 'Барбадос', 'Бахрейн', 'Беларусь', 'Белиз', 'Бельгия', 'Бенин', 'Бермудские Острова', 'Болгария', 'Боливия', 'Босния и Герцеговина', 'Ботсвана', 'Бразилия', 'Британская территория в Индийском океане', 'Бруней', 'Буве', ' Буркина - Фасо', 'Бурунди', 'Бутан', 'Вануату', 'Ватикан', 'Великобритания', 'Венгрия', 'Венесуэла', 'Виргинские Острова(Британские)', ' Виргинские Острова(США)', 'Внешние малые острова(США)', 'Восточный Тимор', 'Вьетнам', 'Габон', 'Гаити', 'Гайана', 'Гамбия', 'Гана', 'Гваделупа', 'Гватемала', 'Гвиана', 'Гвинея', 'Гвинея - Бисау', 'Германия', 'Гернси', 'Гибралтар', 'Гондурас', 'Гонконг', 'Гренада', 'Гренландия', 'Греция', 'Грузия', 'Гуам', 'Дания', 'Джерси', 'Джибути', 'Доминика', 'Доминиканская Республика', 'Египет', 'Замбия', 'Западная Сахара', 'Зимбабве', 'Израиль', 'Индия', 'Индонезия', 'Иордания', 'Ирак', 'Иран', 'Ирландия', 'Исландия', 'Испания', 'Италия', 'Йемен', 'Кабо - Верде', 'Казахстан', 'Каймановы Острова', 'Камбоджа', 'Камерун', 'Канада', 'Катар', 'Кения', 'Кипр', 'Кирибати', 'Китай', 'Кокосовые Острова', 'Колумбия', 'Коморские Острова', 'Конго, Демократическая Республика', ' Корея(Северная)', 'Корея(Южная)', 'Косово', 'Коста - Рика', 'Куба', 'Кувейт', ' Кука острова', 'Кыргызстан', 'Лаос', 'Латвия', 'Лесото', 'Либерия', 'Ливан', 'Ливия', 'Литва', 'Лихтенштейн', 'Маврикий', 'Мавритания',
    'Мадагаскар', 'Майотта', 'Македония', 'Малави', 'Малайзия', 'Мали', 'Мальдивы', 'Мальта', 'Мартиника', 'Маршалловы Острова', 'Мексика', 'Микронезия', 'Мозамбик', 'Молдова', 'Монако', 'Монголия', 'Монтсеррат', 'Морокко', 'Мьянма', 'Нагорно - Карабахская Республика', 'Намибия', 'Науру', 'Непал', 'Нигер', 'Нигерия', 'Нидерланды', 'Никарагуа', 'Ниуэ', 'Новая Зеландия', 'Новая Каледония', 'Норвегия', 'Норфолк', 'Объединенные Арабские Эмираты', 'Оман', 'Остров Мэн', 'Остров Рождества', 'Остров Святой Елены', ' Острова Уоллис и Футуна', 'Острова Херд и Макдональд', 'Пакистан', 'Палестина', 'Панама', 'Папуа — Новая',
    'Гвинея', 'Парагвай', 'Перу', 'Питкэрн', 'Польша', 'Португалия', 'Приднестровье', 'Пуэрто - Рико', 'Республика', 'Конго', 'Реюньон', 'Россия', 'Руанда', 'Румыния', 'Сальвадор', 'Самоа', 'Сан - Марино', 'Сан - Томе', 'Принсипи', 'Саудовская', 'Аравия', 'Свазиленд', 'Свальбард', 'Северные', 'Марианские', 'острова Сейшельские', 'острова Сен - Пьер', 'Микелон', 'Сенегал', 'Сент - Винсент и Гренадины', 'Сент - Киттс и Невис', 'Сент - Люсия', 'Сербия', 'Сингапур', 'Сирия', 'Словения', 'Соединенные Штаты Америки', 'Соломоновы', 'Острова', 'Сомали', 'Сомалиленд', 'Судан', 'Суринам', 'Сьерра - Леоне', 'Таджикистан', 'Таиланд', 'Тайвань', 'Тамил - Илам', 'Танзания', 'Тёркс и Кайкос', 'Токелау', 'Тонга', 'Тувалу', 'Тунис', 'Турецкая', 'Республика Северного Кипра', 'Туркменистан', 'Турция', 'Узбекистан', 'Украина', 'Уругвай', 'Фарерские', 'Острова', 'Фиджи', 'Филиппины', 'Финляндия', 'Фолклендские(Мальвинские)', 'Франция', 'Французская', 'Полинезия', 'Французские', 'Хорватия', 'Черногория', 'Чехия', 'Чили', 'Швейцария', 'Швеция', 'Шри - Ланка', 'Эквадор', 'Экваториальная', 'Гвинея', 'Эритрея', 'Эстония', 'Эфиопия', ' Южная Осетия', 'Южно - Африканская Республика', 'Ямайка', 'Япония']


export const initialValuesForm = {
    password: '',
    email: ''
};
export const initialValuesFormForgot = {
    password: '',
    email: ''
};

export const initialValuesFormCreateUserData: UserData = {
    nickname: '',
    name: '',
    surname: '',
    sex: '',
    country: '',
    region: '',
    myCar: ''
};
export const initialValuesFormBlogAdd: UserBlog = {
    text: '',
    title: ''
};